n5/src/Catalogs/Contracts/Contracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerVATAdvance</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Export</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Import</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Signed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SignedAll</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>DocumentRef.Document</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorItems</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorServices</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/CommonModules/OrganizationsForm/Module.bsl
Procedure CreateContract ( Object, Ref ) export
	
	SetPrivilegedMode ( true );
	customer = Object.Customer;
	vendor = Object.Vendor;
	settings = Logins.Settings ( "Company" );
	obj = Catalogs.Contracts.CreateItem ();
	Metafields.Constructor ( obj );
	obj.DataExchange.Load = true;
	obj.Owner = ref;
	obj.Creator = SessionParameters.User;
	obj.Description = Output.General ();
	obj.Company = settings.Company;
	obj.Currency = Application.Currency ();
	obj.Customer = customer;
	obj.Vendor = vendor;
	data = Catalogs.Contracts.GetDefaults ( Ref, customer );
	monthlyAdvances = data.AdvancesMonthly;
	closeAdvances = not monthlyAdvances;
	if ( customer ) then
		obj.CustomerTerms = Constants.Terms.Get ();
		obj.CustomerPayment = Constants.PaymentMethod.Get ();
		obj.CustomerVATAdvance = data.VATAdvance;
		obj.CustomerAdvancesMonthly = monthlyAdvances;
		obj.CustomerAdvances = closeAdvances;
	endif;
	if ( vendor ) then
		obj.VendorTerms = Constants.VendorTerms.Get ();
		obj.VendorPayment = Constants.VendorPaymentMethod.Get ();
		obj.VendorAdvancesMonthly = monthlyAdvances;
		obj.VendorAdvances = closeAdvances;
	endif; 
	obj.Write ();
	if ( customer ) then
		Object.CustomerContract = obj.Ref;
	endif; 
	if ( vendor ) then
		Object.VendorContract = obj.Ref;
	endif; 
	
EndProcedure
